{"keras_version": "2.0.8-tf", "config": {"output_layers": [["dense_2", 0, 0]], "name": "classifier", "layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_3", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "name": "conv2d_4", "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [2, 2], "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "dtype": "float32", "trainable": true}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "units": 1024, "activation": "relu", "activity_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "units": 1, "activation": "sigmoid", "activity_regularizer": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}